app/Controllers/Login.php

    public function exito(){
        $this->encriptado=\Config\Services::encrypter();
        $email=$this->request->getPost(['email'])["email"];
        $pass=$this->request->getPost(['pass'])["pass"];
        $user=new UsuarioModel();
        $data=$user->where('emailUsuario',$email)->findColumn("passUsuario");
        $passDB=$this->encriptado->decrypt(base64_decode($data[0]));
        $userInfo=$user->where('emailUsuario',$email)->where("passUsuario",$data[0])->find();
---
SELECT `passUsuario`
FROM `Usuarios`
WHERE `emailUsuario` = ('jase.22@hotmail.com')
SELECT *
FROM `Usuarios`
WHERE `emailUsuario` = ('jase.22@hotmail.com')
AND `passUsuario` = 'Vp76lOzFVovX3j3PvDdV3St8EyOfDBvsX+58f26ob8KDmDljpQ6/4+RkIEC1+e+46/FV+xR+FJEq310E80GC6KEkgGyZHqfya+QunA/j5XUHLQiRATexcSV2'