app/Controllers/Registrar.php

    public function exito(){
        $usuario=new UsuarioModel();
        $post=$this->request->getPost(['user',"email","pass"]);
        $validacion = service('validation');
        $reglas=[
            "user" => "required|min_length[4]|max_length[15]|alpha_numeric",
            "email" => "required|min_length[5]|max_length[255]",
            "pass" => "required|min_length[8]|max_length[16]|alpha_numeric|in_list[#|_\$%&¡!¿?]"
        ];
        $validacion->setRules($reglas,errorMessages($reglas));
        if (!$validacion->withRequest($this->request)->run())
        {
            return redirect()->to("/public/index.php/registrar")->withInput()->with('errors',$validacion->getErrors());
        }
        exit();


        $user=new UsuarioModel();
        $mensaje=array();
        $data=$user->where('usuarioUsuario',$post["user"])->findColumn("idUsuario");
        if(!empty($data)){
            $mensaje["usuario"]= "El usuario ingresado ya está en uso.";
        }
        $data=$user->where('emailUsuario',$post["email"])->findColumn("idUsuario");
---
SELECT `idUsuario`
FROM `Usuarios`
WHERE `usuarioUsuario` = 'Javierochoa159'
SELECT `idUsuario`
FROM `Usuarios`
WHERE `emailUsuario` = 'javierochoa159@gmail.com'